--1
select "Н_ЛЮДИ"."ИМЯ", "Н_СЕССИЯ"."УЧГОД"
FROM "Н_ЛЮДИ"
INNER JOIN "Н_СЕССИЯ" ON "Н_СЕССИЯ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
WHERE "Н_ЛЮДИ"."ФАМИЛИЯ" < 'Соколов' AND "Н_СЕССИЯ"."ЧЛВК_ИД" = 126631 AND "Н_СЕССИЯ"."ЧЛВК_ИД" < 106059;

--2
SELECT "Н_ЛЮДИ"."ОТЧЕСТВО", "Н_ОБУЧЕНИЯ"."НЗК", "Н_УЧЕНИКИ"."ГРУППА"
FROM "Н_ЛЮДИ"
INNER JOIN "Н_ОБУЧЕНИЯ" ON "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
INNER JOIN "Н_УЧЕНИКИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
WHERE "Н_ЛЮДИ"."ОТЧЕСТВО" > 'Сергеевич' AND "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД" = 105590;

--3
SELECT COUNT(*)
FROM "Н_УЧЕНИКИ"
JOIN "Н_ЛЮДИ" ON "Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
WHERE ("Н_УЧЕНИКИ"."ГРУППА" = '3102' AND "Н_ЛЮДИ"."ИНН" IS NULL);

--4
SELECT "Н_ГРУППЫ_ПЛАНОВ"."ГРУППА"
FROM "Н_ГРУППЫ_ПЛАНОВ"
JOIN "Н_ПЛАНЫ" ON "Н_ГРУППЫ_ПЛАНОВ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
JOIN "Н_УЧЕНИКИ" ON "Н_ГРУППЫ_ПЛАНОВ"."ГРУППА" = "Н_УЧЕНИКИ"."ГРУППА" AND
                    "НАЧАЛО" < '01.01.2012' AND
                    "КОНЕЦ" >= '01.01.2011'
WHERE (SELECT "Н_ОТДЕЛЫ"."КОРОТКОЕ_ИМЯ"
       FROM "Н_ОТДЕЛЫ"
       WHERE "Н_ОТДЕЛЫ"."КОРОТКОЕ_ИМЯ" = 'КТиУ') = 'КТиУ'
GROUP BY "Н_ГРУППЫ_ПЛАНОВ"."ГРУППА"
HAVING COUNT(*) < 10;


--5
SELECT "Н_УЧЕНИКИ"."ГРУППА", AVG(EXTRACT(YEAR from AGE("Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ"))::NUMERIC) AS av_age
FROM "Н_УЧЕНИКИ"
         JOIN "Н_ЛЮДИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
GROUP BY "Н_УЧЕНИКИ"."ГРУППА"
HAVING AVG(EXTRACT(YEAR FROM AGE("Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ"))::NUMERIC) =
       (SELECT MAX(EXTRACT(YEAR FROM AGE("Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ")))
        FROM "Н_ЛЮДИ"
                 JOIN "Н_УЧЕНИКИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД" AND "Н_УЧЕНИКИ"."ГРУППА" = '3100');


--6
SELECT "Н_УЧЕНИКИ"."ГРУППА",
       "Н_ЛЮДИ"."ИД",
       "Н_ЛЮДИ"."ФАМИЛИЯ",
       "Н_ЛЮДИ"."ИМЯ",
       "Н_ЛЮДИ"."ОТЧЕСТВО",
       "Н_УЧЕНИКИ"."П_ПРКОК_ИД"
FROM "Н_УЧЕНИКИ"
         JOIN "Н_ЛЮДИ" ON "Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
         JOIN "Н_ПЛАНЫ" ON "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
         JOIN "Н_ФОРМЫ_ОБУЧЕНИЯ" ON "Н_ПЛАНЫ"."ФО_ИД" = "Н_ФОРМЫ_ОБУЧЕНИЯ"."ИД"
    AND "Н_ФОРМЫ_ОБУЧЕНИЯ"."НАИМЕНОВАНИЕ" = 'Очная'
WHERE "Н_УЧЕНИКИ"."ИД" IN (
    SELECT "Н_УЧЕНИКИ"."ИД" FROM "Н_УЧЕНИКИ"
    WHERE "Н_УЧЕНИКИ"."ПРИЗНАК" = 'отчисл'
      AND "Н_УЧЕНИКИ"."КОНЕЦ" = '01-09-2012'
);



--7
select "Н_УЧЕНИКИ"."ИД", "ИМЯ", "ОТЧЕСТВО"
from "Н_УЧЕНИКИ"
         join "Н_ЛЮДИ" on "Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
where "ЧЛВК_ИД" in (select "ИД"
                    from "Н_ЛЮДИ"
where "ОТЧЕСТВО" in (select "ОТЧЕСТВО" from "Н_ЛЮДИ" group by "ОТЧЕСТВО" having count("ОТЧЕСТВО") > 1)
and "ИД" in (select "ИД" from "Н_ЛЮДИ" group by "ИД" having count("ИД") = 1));
